src/cf/src/Documents/ПоступлениеДополнительныхРасходов/ПоступлениеДополнительныхРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДополнительныхРасходов</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПартии</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаТовара</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Субподрядчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/ПоступлениеДополнительныхРасходов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НомерСтраницы = 1;
	ПрименитьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Состояние панели сведений восстанавливается из сохранённых данных формы.
	ПрименитьСостояниеПанели();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	ПрименитьОтборы();

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	// Отложенно: при листании стрелками не дёргать сервер на каждую строку.
	// BSLLS:MagicNumber-off - треть секунды, константа имени не добавит.
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСведения", 0.3, Истина);
	// BSLLS:MagicNumber-on

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСведения()

	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.ПоступлениеДополнительныхРасходов") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСведения(Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПанель(Команда)

	ПанельСвернута = Истина;
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)

	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФильтры(Команда)

	ОткрытьСтраницуПанели("СтраницаФильтры");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКлиента(Команда)

	ОткрытьСтраницуПанели("СтраницаКлиент");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДетали(Команда)

	ОткрытьСтраницуПанели("СтраницаИнфо");

КонецПроцедуры

&НаКлиенте
Процедура СтраницаНазад(Команда)

	Если НомерСтраницы > 1 Тогда
		НомерСтраницы = НомерСтраницы - 1;
		ПрименитьСтраницу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаВперед(Команда)

	Если НомерСтраницы < ВсегоСтраниц Тогда
		НомерСтраницы = НомерСтраницы + 1;
		ПрименитьСтраницу();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Свёрнутая панель - столбик значков, развёрнутая - закладки со страницами.
// Значок открывает панель сразу на своей странице, как в УНФ.
//
&НаКлиенте
Процедура ПрименитьСостояниеПанели()

	Элементы.ГруппаПанельЗначки.Видимость = ПанельСвернута;
	Элементы.ГруппаПодвалПанели.Видимость = Не ПанельСвернута;
	Элементы.ГруппаСтраницыСведений.Видимость = Не ПанельСвернута;

КонецПроцедуры

// Разворачивает панель и активирует страницу по имени.
//
// Параметры:
//  ИмяСтраницы - Строка - имя страницы панели сведений
//
&НаКлиенте
Процедура ОткрытьСтраницуПанели(ИмяСтраницы)

	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();
	Элементы.ГруппаСтраницыСведений.ТекущаяСтраница = Элементы[ИмяСтраницы];

КонецПроцедуры

// Ставит либо снимает отборы динамического списка по полям правой панели.
// Отборы программные: пользовательские настройки списка их не перетирают.
//
&НаСервере
Процедура ПрименитьОтборы()

	Отборы = Новый Структура;
	Отборы.Вставить("Контрагент", ОтборКонтрагент);
	Отборы.Вставить("Организация", ОтборОрганизация);
	Отборы.Вставить("Ответственный", ОтборОтветственный);

	Для Каждого Отбор Из Отборы Цикл
		УстановитьОтборПоПолю(Отбор.Ключ, Отбор.Значение);
	КонецЦикла;

	УстановитьОтборПоПолю("Сумма", ОтборСумма, ВидСравненияУсловия(ОтборСуммаУсловие));

	НомерСтраницы = 1;
	ПрименитьСтраницу();

КонецПроцедуры

// Вид сравнения отбора по позиции тумблера знака.
//
// Параметры:
//  Позиция - Число - 0 - больше, 1 - меньше, 2 - равно
//
// Возвращаемое значение:
//  ВидСравненияКомпоновкиДанных
//
&НаСервере
Функция ВидСравненияУсловия(Позиция)

	// BSLLS:MagicNumber-off - значения объявлены списком выбора тумблера знака.
	Если Позиция = 1 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
	ИначеЕсли Позиция = 2 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		Возврат ВидСравненияКомпоновкиДанных.Больше;
	КонецЕсли;
	// BSLLS:MagicNumber-on

КонецФункции

// Знак сравнения для текста запроса по позиции тумблера знака.
//
// Параметры:
//  Позиция - Число - 0 - больше, 1 - меньше, 2 - равно
//
// Возвращаемое значение:
//  Строка
//
&НаСервере
Функция ЗнакУсловия(Позиция)

	// BSLLS:MagicNumber-off - значения объявлены списком выбора тумблера знака.
	Если Позиция = 1 Тогда
		Возврат "<";
	ИначеЕсли Позиция = 2 Тогда
		Возврат "=";
	Иначе
		Возврат ">";
	КонецЕсли;
	// BSLLS:MagicNumber-on

КонецФункции

// Один программный элемент отбора списка: значение пусто - элемент снимается.
// Список значений отбирается видом сравнения «В списке».
//
// Параметры:
//  Поле         - Строка       - имя поля динамического списка
//  Значение     - Произвольный - отбираемое значение или СписокЗначений
//  ВидСравнения - ВидСравненияКомпоновкиДанных, Неопределено - вид сравнения;
//                 не задан - «Равно» («В списке» для списка значений)
//
&НаСервере
Процедура УстановитьОтборПоПолю(Поле, Значение, ВидСравнения = Неопределено)

	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);

	Найденный = Неопределено;
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных")
			И Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
			Найденный = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	ЗначениеПусто = Не ЗначениеЗаполнено(Значение);
	Если ЗначениеПусто Тогда
		Если Найденный <> Неопределено Тогда
			Список.Отбор.Элементы.Удалить(Найденный);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если Найденный = Неопределено Тогда
		Найденный = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Найденный.ЛевоеЗначение = ПолеКомпоновки;
	КонецЕсли;
	Если ВидСравнения <> Неопределено Тогда
		Найденный.ВидСравнения = ВидСравнения;
	ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Найденный.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		Найденный.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	Найденный.ПравоеЗначение = Значение;
	Найденный.Использование = Истина;

КонецПроцедуры

// Постраничный просмотр: список ограничивается ссылками текущей страницы,
// счётчик «N / M» считается тем же набором условий, что и отборы панели.
// Страницы режутся по дате от новых к старым.
//
&НаСервере
Процедура ПрименитьСтраницу()

	// BSLLS:MagicNumber-off - размер страницы, используется только здесь.
	РазмерСтраницы = 50;
	// BSLLS:MagicNumber-on

	Условия = Новый Массив;
	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		Условия.Добавить("Док.Контрагент = &Контрагент");
		Запрос.УстановитьПараметр("Контрагент", ОтборКонтрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Условия.Добавить("Док.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ОтборОрганизация);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборОтветственный) Тогда
		Условия.Добавить("Док.Ответственный = &Ответственный");
		Запрос.УстановитьПараметр("Ответственный", ОтборОтветственный);
	КонецЕсли;
	Если ОтборСумма <> 0 Тогда
		Условия.Добавить("Док.Сумма " + ЗнакУсловия(ОтборСуммаУсловие) + " &СуммаОтбора");
		Запрос.УстановитьПараметр("СуммаОтбора", ОтборСумма);
	КонецЕсли;

	ТекстУсловий = "";
	Если Условия.Количество() > 0 Тогда
		ТекстУсловий = "
			|ГДЕ
			|	" + СтрСоединить(Условия, "
			|	И ");
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Док.Ссылка) КАК Всего
		|ИЗ
		|	Документ.ПоступлениеДополнительныхРасходов КАК Док" + ТекстУсловий;
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = 0;
	Если Выборка.Следующий() Тогда
		Всего = Выборка.Всего;
	КонецЕсли;

	ВсегоСтраниц = Макс(1, Цел((Всего + РазмерСтраницы - 1) / РазмерСтраницы));
	НомерСтраницы = Макс(1, НомерСтраницы);
	НомерСтраницы = Мин(НомерСтраницы, ВсегоСтраниц);

	ПолеСсылки = "Ссылка";
	Если ВсегоСтраниц = 1 Тогда
		УстановитьОтборПоПолю(ПолеСсылки, Неопределено);
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ " + Формат(НомерСтраницы * РазмерСтраницы, "ЧГ=") + "
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПоступлениеДополнительныхРасходов КАК Док" + ТекстУсловий + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	Док.Дата УБЫВ,
			|	Док.Ссылка";
		Ссылки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

		СсылкиСтраницы = Новый СписокЗначений;
		Для Индекс = (НомерСтраницы - 1) * РазмерСтраницы По Ссылки.ВГраница() Цикл
			СсылкиСтраницы.Добавить(Ссылки[Индекс]);
		КонецЦикла;
		УстановитьОтборПоПолю(ПолеСсылки, СсылкиСтраницы);
	КонецЕсли;

	Элементы.НадписьСтраницы.Заголовок = СтрШаблон("%1 / %2", НомерСтраницы, ВсегоСтраниц);
	Элементы.КнопкаСтраницаНазад.Доступность = НомерСтраницы > 1;
	Элементы.КнопкаСтраницаВперед.Доступность = НомерСтраницы < ВсегоСтраниц;

КонецПроцедуры

// Правая панель: сведения о документе текущей строки и его состав.
//
// Параметры:
//  Ссылка - ДокументСсылка.ПоступлениеДополнительныхРасходов - текущая строка списка
//
&НаСервере
Процедура ЗаполнитьСведения(Знач Ссылка)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Док.Контрагент КАК Контрагент,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.ВидКонтрагента КАК ВидКонтрагента,
		|	Контрагенты.Категория КАК Категория,
		|	Контрагенты.РодДеятельности КАК РодДеятельности,
		|	Контрагенты.NIF КАК NIF,
		|	Контрагенты.RC КАК RC,
		|	Контрагенты.ICE КАК ICE,
		|	Контрагенты.CIN КАК CIN,
		|	Контрагенты.ТипОплаты КАК ТипОплаты,
		|	Контрагенты.УсловияОплаты КАК УсловияОплаты,
		|	Контрагенты.СрокОплаты КАК СрокОплаты,
		|	Контрагенты.ТипЦены КАК ТипЦены,
		|	Контрагенты.КонтрольКредита КАК КонтрольКредита,
		|	Контрагенты.СуммаКредита КАК СуммаКредита,
		|	Контрагенты.ЗапретОтгрузок КАК ЗапретОтгрузок,
		|	Док.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Док.СтатьяДДС КАК СтатьяДДС,
		|	Док.Организация КАК Организация,
		|	Док.Ответственный КАК Ответственный,
		|	Док.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	Док.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	Док.Комментарий КАК Комментарий,
		|	Док.Сумма КАК Сумма
		|ИЗ
		|	Документ.ПоступлениеДополнительныхРасходов КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Контрагенты.Ссылка = Док.Контрагент
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	Реквизиты.Реквизит КАК Реквизит,
		|	Реквизиты.Представление КАК Представление
		|ИЗ
		|	Документ.ПоступлениеДополнительныхРасходов КАК Док
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыКонтрагентов КАК Реквизиты
		|		ПО Реквизиты.Контрагент = Док.Контрагент
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	СУММА(Остатки.СуммаОстаток) КАК Долг
		|ИЗ
		|	РегистрНакопления.ВзаиморасчётыСПоставщиками.Остатки(
		|		,
		|		Контрагент В
		|			(ВЫБРАТЬ
		|				Док.Контрагент КАК Контрагент
		|			ИЗ
		|				Документ.ПоступлениеДополнительныхРасходов КАК Док
		|			ГДЕ
		|				Док.Ссылка = &Ссылка)) КАК Остатки
		|;
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	СУММА(Товары.Количество) КАК Количество,
		|	СУММА(Товары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПоступлениеДополнительныхРасходов.ТЧТовары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результаты = Запрос.ВыполнитьПакет();

	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	ФорматСуммы = "ЧДЦ=2; ЧРГ=' '";

	// Страница «Клиент»: карточка контрагента, контакты и общий долг.
	Долг = 0;
	Долги = Результаты[2].Выбрать();
	Если Долги.Следующий() И ЗначениеЗаполнено(Долги.Долг) Тогда
		Долг = Долги.Долг;
	КонецЕсли;
	КлиентТекст = ТекстКлиента(Шапка, Результаты[1].Выбрать(), Долг);

	// Страница «Детали»: реквизиты документа, не выведенные колонками списка.
	Строки = Новый Массив;
	Строки.Добавить(Строка(Шапка.ХозяйственнаяОперация));
	Если ЗначениеЗаполнено(Шапка.СтатьяДДС) Тогда
		Шаблон = НСтр("ru = 'Статья ДДС: %1'; fr = 'Poste de trésorerie: %1'; en = 'Cash flow item: %1'; es = 'Partida de tesorería: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.СтатьяДДС)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Организация) Тогда
		Шаблон = НСтр("ru = 'Наша компания: %1'; fr = 'Notre société: %1'; en = 'Our company: %1'; es = 'Nuestra empresa: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Организация)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Ответственный) Тогда
		Шаблон = НСтр("ru = 'Ответственный: %1'; fr = 'Responsable: %1'; en = 'Responsible: %1'; es = 'Responsable: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Ответственный)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.НомерВходящегоДокумента) Тогда
		Шаблон = НСтр("ru = 'Входящий номер: %1'; fr = 'Numéro entrant: %1'; en = 'Incoming number: %1'; es = 'Número entrante: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.НомерВходящегоДокумента)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.ДатаВходящегоДокумента) Тогда
		Шаблон = НСтр("ru = 'Дата входящего: %1'; fr = 'Date entrante: %1'; en = 'Incoming date: %1'; es = 'Fecha entrante: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.ДатаВходящегоДокумента)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Комментарий) Тогда
		Строки.Добавить("");
		Строки.Добавить(Шапка.Комментарий);
	КонецЕсли;
	Строки.Добавить("");
	ШаблонСуммы = НСтр("ru = 'Сумма: %1'; fr = 'Montant : %1'; en = 'Amount: %1'; es = 'Importe: %1'");
	СуммаСтрокой = Формат(Шапка.Сумма, ФорматСуммы);
	Строки.Добавить(СтрШаблон(ШаблонСуммы, СуммаСтрокой));
	ИнфоТекст = СтрСоединить(Строки, Символы.ПС);

	ТаблицаСостав.Очистить();
	Состав = Результаты[3].Выбрать();
	Пока Состав.Следующий() Цикл
		Строка = ТаблицаСостав.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Состав);
	КонецЦикла;

КонецПроцедуры

// Карточка контрагента для страницы «Клиент»: наименование, классификация,
// налоговые реквизиты, условия работы, контакты и общий долг.
//
// Параметры:
//  Шапка    - ВыборкаИзРезультатаЗапроса - строка запроса по документу и контрагенту
//  Контакты - ВыборкаИзРезультатаЗапроса - реквизиты контрагента из регистра
//  Долг     - Число - остаток взаиморасчётов; 0 - не показывается
//
// Возвращаемое значение:
//  Строка - многострочный текст панели
//
&НаСервереБезКонтекста
Функция ТекстКлиента(Шапка, Контакты, Знач Долг = 0)

	Строки = Новый Массив;
	Строки.Добавить(Строка(Шапка.Контрагент));
	Если ЗначениеЗаполнено(Шапка.НаименованиеПолное) Тогда
		Строки.Добавить(Шапка.НаименованиеПолное);
	КонецЕсли;
	ДобавитьСтрокуСведений(Строки, НСтр("ru = 'Вид'; fr = 'Type'; en = 'Kind'; es = 'Tipo'"),
		Шапка.ВидКонтрагента);
	ДобавитьСтрокуСведений(Строки,
		НСтр("ru = 'Категория'; fr = 'Catégorie'; en = 'Category'; es = 'Categoría'"), Шапка.Категория);
	ДобавитьСтрокуСведений(Строки,
		НСтр("ru = 'Род деятельности'; fr = 'Activité'; en = 'Line of business'; es = 'Actividad'"),
		Шапка.РодДеятельности);

	ДобавитьБлокСтрок(Строки, НалоговыеРеквизитыКонтрагента(Шапка));
	ДобавитьБлокСтрок(Строки, УсловияРаботыСКонтрагентом(Шапка));
	ДобавитьБлокСтрок(Строки, КонтактыКонтрагента(Контакты));

	Если ЗначениеЗаполнено(Долг) Тогда
		ШаблонДолга = НСтр("ru = 'Долг всего: %1'; fr = 'Dette totale : %1';
			|en = 'Total debt: %1'; es = 'Deuda total: %1'");
		Итог = Новый Массив;
		Итог.Добавить(СтрШаблон(ШаблонДолга, Формат(Долг, "ЧДЦ=2; ЧРГ=' '")));
		ДобавитьБлокСтрок(Строки, Итог);
	КонецЕсли;

	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

// Налоговые и регистрационные номера карточки одной строкой.
//
// Параметры:
//  Шапка - ВыборкаИзРезультатаЗапроса - строка запроса по контрагенту
//
// Возвращаемое значение:
//  Массив из Строка - пустой, если номера не заполнены
//
&НаСервереБезКонтекста
Функция НалоговыеРеквизитыКонтрагента(Шапка)

	Номера = Новый Массив;
	Для Каждого ИмяРеквизита Из СтрРазделить("NIF,RC,ICE,CIN", ",") Цикл
		Если ЗначениеЗаполнено(Шапка[ИмяРеквизита]) Тогда
			Номера.Добавить(ИмяРеквизита + ": " + Строка(Шапка[ИмяРеквизита]));
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Массив;
	Если Номера.Количество() > 0 Тогда
		Результат.Добавить(СтрСоединить(Номера, "   "));
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Условия работы с контрагентом: оплата, цены, кредитный контроль.
//
// Параметры:
//  Шапка - ВыборкаИзРезультатаЗапроса - строка запроса по контрагенту
//
// Возвращаемое значение:
//  Массив из Строка - заполненные условия
//
&НаСервереБезКонтекста
Функция УсловияРаботыСКонтрагентом(Шапка)

	Условия = Новый Массив;
	ДобавитьСтрокуСведений(Условия,
		НСтр("ru = 'Тип оплаты'; fr = 'Mode de paiement'; en = 'Payment type'; es = 'Tipo de pago'"),
		Шапка.ТипОплаты);
	ДобавитьСтрокуСведений(Условия,
		НСтр("ru = 'Условия оплаты'; fr = 'Conditions de paiement';
			|en = 'Payment terms'; es = 'Condiciones de pago'"), Шапка.УсловияОплаты);
	ДобавитьСтрокуСведений(Условия,
		НСтр("ru = 'Отсрочка, дней'; fr = 'Délai, jours'; en = 'Deferral, days'; es = 'Aplazamiento, días'"),
		Шапка.СрокОплаты);
	ДобавитьСтрокуСведений(Условия,
		НСтр("ru = 'Тип цены'; fr = 'Type de prix'; en = 'Price type'; es = 'Tipo de precio'"), Шапка.ТипЦены);
	Если Шапка.КонтрольКредита Тогда
		ДобавитьСтрокуСведений(Условия,
			НСтр("ru = 'Кредитный лимит'; fr = 'Limite de crédit';
				|en = 'Credit limit'; es = 'Límite de crédito'"), Шапка.СуммаКредита);
	КонецЕсли;
	Если Шапка.ЗапретОтгрузок Тогда
		Условия.Добавить(НСтр("ru = 'Отгрузки запрещены'; fr = 'Expéditions interdites';
			|en = 'Shipments blocked'; es = 'Expediciones bloqueadas'"));
	КонецЕсли;
	Возврат Условия;

КонецФункции

// Контактные данные контрагента из регистра реквизитов.
//
// Параметры:
//  Контакты - ВыборкаИзРезультатаЗапроса - реквизиты контрагента
//
// Возвращаемое значение:
//  Массив из Строка - строки «реквизит: значение»
//
&НаСервереБезКонтекста
Функция КонтактыКонтрагента(Контакты)

	Строки = Новый Массив;
	Пока Контакты.Следующий() Цикл
		Строки.Добавить(Строка(Контакты.Реквизит) + ": " + Контакты.Представление);
	КонецЦикла;
	Возврат Строки;

КонецФункции

// Добавляет блок строк, отделяя его от предыдущего пустой строкой.
//
// Параметры:
//  Строки - Массив из Строка - накопитель строк панели
//  Блок   - Массив из Строка - добавляемые строки; пустой блок пропускается
//
&НаСервереБезКонтекста
Процедура ДобавитьБлокСтрок(Строки, Блок)

	Если Блок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Строки.Добавить("");
	Для Каждого Строка Из Блок Цикл
		Строки.Добавить(Строка);
	КонецЦикла;

КонецПроцедуры

// Добавляет строку «подпись: значение», если значение заполнено.
//
// Параметры:
//  Строки   - Массив из Строка - накопитель строк
//  Подпись  - Строка           - подпись показателя
//  Значение - Произвольный     - значение; пустое не выводится
//
&НаСервереБезКонтекста
Процедура ДобавитьСтрокуСведений(Строки, Подпись, Значение)

	Если ЗначениеЗаполнено(Значение) Тогда
		Строки.Добавить(Подпись + ": " + Строка(Значение));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
